tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# utils
brew "cmake"
brew "yasm"
cask "qlcolorcode"
cask "qlstephen"
cask "paste"

# dev
cask "visual-studio-code"
cask "sourcetree"
cask "figma"
cask "zoomus"
cask "slack"
cask "charles"
cask "duet"

brew "cocoapods", link: false
brew "fastlane"
brew "flutter"
brew "swiftlint"
brew "xcodegen"
cask "swimat"
cask "sf-symbols"
cask "db-browser-for-sqlite"
cask "realm-studio"

# brew "libimobiledevice", args: ["HEAD"]
# brew "ideviceinstaller"
# brew "ios-deploy"
# brew "libusbmuxd", args: ["HEAD"]

# other
cask "1password"
cask "firefox"
cask "google-chrome"
cask "spotify"
cask "telegram"
cask "windscribe"
cask "dropbox"
cask "setapp"
cask "spark"
cask "tripmode"
