# Homebrew Taps
# Additional repositories for Homebrew packages
tap "homebrew/bundle"
tap "xcodesorg/made"
tap "leoafarias/fvm"
tap "tuist/tuist"
tap "tw93/tap"

# ============================================================================
# CLI Tools and Development Libraries
# ============================================================================

# Download with resuming and segmented downloading
brew "aria2"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Best command-line tool to install and switch between multiple versions of Xcode
brew "xcodesorg/made/xcodes"

# JavaScript Runtime
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Node.js version 18 (LTS)
brew "node@18"

# Ruby Development
# Ruby version manager
brew "rbenv"

# Mobile Development Tools
# Easiest way to build and release mobile apps
brew "fastlane"
# Firebase command-line tools
brew "firebase-cli"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# Create, maintain, and interact with Xcode projects at scale
brew "tuist/tuist/tuist@4.55.6"

# Git Tools
# Git extension for versioning large files
brew "git-lfs"

# System Libraries
brew "glib"
brew "harfbuzz"

# Utilities
# Comprehensive macOS cleanup and application uninstall tool
brew "tw93/tap/mole"

# ============================================================================
# GUI Applications
# ============================================================================

# Development Tools
# Xcode Extension for reformatting Swift code
cask "swiftformat-for-xcode"
# Modern terminal
cask "warp"
# Xcode version manager GUI
cask "xcodes"
# Clean up Xcode derived data
cask "devcleaner"

# Version Control
cask "sourcetree"

# Browsers
cask "arc"

# Productivity & Utilities
cask "chatgpt"
cask "lunar"

# Quick Look Plugins
# Syntax highlighting for code files
cask "qlcolorcode"
# Quick Look plugin for plain text files
cask "qlstephen"
