tap "homebrew/bundle"
tap "xcodesorg/made"

# CLI tools and libraries
brew "aria2"
brew "glib"
brew "check-jsonschema"
brew "cocoapods"
brew "harfbuzz"
brew "node"
brew "node@18"
brew "openjdk@11"
brew "swiftformat"
brew "xcodesorg/made/xcodes"

# GUI apps
cask "swiftformat-for-xcode"
cask "warp"
cask "xcodes"
cask "1password"
cask "arc"
cask "chatgpt"
cask "devcleaner"
cask "figma"
cask "firefoo"
cask "lunar"
cask "meeter"
cask "rocketsim"
cask "slack"
cask "sourcetree"
cask "surfshark-vpn"
cask "telegram"
cask "visual-studio-code"
cask "xcode"
cask "zoom"
cask "sf-symbols"
cask "spark"

cask "qlcolorcode"
cask "qlstephen"
